<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

//定义简短路由访问自定义方法
return [
    // 路由参数name为可选
    'add/[:name]$' => 'index/add',
    'show/[:name]$' => 'index/show',
    'del/[:name]$' => 'index/del',
    'save/[:name]$' => 'index/save',
];
